# Урок 8. Работа с файлами
#
# Задача 38: Дополнить телефонный справочник возможностью
# изменения и удаления данных. Пользователь также может
# ввести имя или фамилию, и Вы должны реализовать
# функционал для изменения и удаления данных
#
import controller

if __name__ == "__main__":
    controller.actions




#
# Урок 9. Работа с табличными данными
#
# доработать телефонный справочник в модульном варианте
#
#
# Урок 10. Построение графиков
#
# | Задание 44 |
# | --- |
# | В ячейке ниже представлен код генерирующий DataFrame,
# которая состоит всего из 1 столбца. Ваша задача перевести
# его в one hot вид. Сможете ли вы это сделать без get_dummies?
#
# import random
# lst = ['robot'] * 10
# lst += ['human'] * 10
# random.shuffle(lst)
# data = pd.DataFrame({'whoAmI'lst})
# data.head() |
#
